// Задача 25: Напишите цикл, который принимает на вход два 
// числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16



Console.WriteLine("Введите число которое будете возводит");
int numA = Convert.Toint32(Console.ReadLine());

Console.WriteLine("Введите степень число ");
int numB = Convert.Toint32(console.ReadLine());